app/views/bookmark/index.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."category_id" = ? ORDER BY id desc  [["category_id", 1]]
---
                <ul class="card-list">
                    <% category.bookmarks.order('id desc').each do |bookmark| %>