app/controllers/bookmark_controller.rb

    def addBookmark
        @user = current_user
        begin
            link = LinkThumbnailer.generate(params[:title])
                    bookmark = Bookmark.new(category_id: params[:categoryId],
                                            title: link.title,
                                            link: params[:title],
                                            img_url: link.images.first.src.to_s)
            bookmark.save
---
INSERT INTO "bookmarks" ("category_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["title", "asdfasdf"], ["created_at", "2017-08-14 18:35:57.840497"], ["updated_at", "2017-08-14 18:35:57.840497"]]