app/controllers/category_controller.rb

INSERT INTO "categories" ("user_id", "color", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["color", "#008000"], ["title", "rrtrwet"], ["created_at", "2017-08-14 18:56:55.530174"], ["updated_at", "2017-08-14 18:56:55.530174"]]
---
    def addCategory
        @user = current_user

        colors = ['#ff5000', '#008000', '#f00000', '#333', '#fff000']
        color = colors.sample

        category = Category.new(user_id: @user.id,
                                color: color,
                                title: params[:title])
        category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "title" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["title", "first"], ["updated_at", "2017-08-15 15:18:33.730921"], ["id", 1]]
---
    def modifyCategory

        category = Category.find(params[:id])
        category.title = params[:title]
        category.save